#### Importing Necessary Libraries

In [1]:
import pandas as pd
import numpy as np

#### The Extraction Layer

In [2]:
sales_perf_df = pd.read_csv(r'C:\Users\USER\Desktop\Sale Performance\Sale-Performance\Dataset\rawdata\Sales Dataset - Sales Dataset.csv')

In [3]:
sales_perf_df.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [4]:
sales_perf_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   object
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

#### Data Cleaning and Transformation

In [5]:
# covert order_date to datetime
sales_perf_df['Order Date'] = pd.to_datetime(sales_perf_df['Order Date'])
sales_perf_df['Year-Month'] = pd.to_datetime(sales_perf_df['Year-Month'])

In [6]:
sales_perf_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   datetime64[ns]
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(7)
memory usage: 112.1+ KB

#### Building Dataframe

In [7]:
# Customer table
Customers_df = sales_perf_df[['CustomerName', 'State', 'City']].copy().drop_duplicates().reset_index(drop=True)
Customers_df["customer_Id"] = Customers_df.index + 1
Customers_df.head()

    CustomerName     State     City  customer_Id
0  David Padilla   Florida    Miami            1
1  Connor Morgan  Illinois  Chicago            2
2   Robert Stone  New York  Buffalo            3
3    John Fields   Florida  Orlando            4
4  Clayton Smith   Florida    Miami            5

In [8]:
# Product table
Products_df = sales_perf_df[['Category', 'Sub-Category', 'Amount']].copy().drop_duplicates().reset_index(drop=True)
Products_df["category_Id"] = Products_df.index + 1
Products_df.head()

          Category      Sub-Category  Amount  category_Id
0      Electronics  Electronic Games    9726            1
1      Electronics          Printers    4975            2
2  Office Supplies              Pens    1525            3
3      Electronics           Laptops     883            4
4        Furniture            Tables    8127            5

In [9]:
# Payment table
Payments_df = sales_perf_df[['Order ID', 'PaymentMode']].copy().drop_duplicates().reset_index(drop=True)
Payments_df["payment_Id"] = Payments_df.index + 1
Payments_df.head()

  Order ID  PaymentMode  payment_Id
0  B-26776          UPI           1
1  B-26942   Debit Card           2
2  B-26640          EMI           3
3  B-26640  Credit Card           4
4  B-25890          UPI           5

In [10]:
sales_perf_df.columns

Index(['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
       'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City',
       'Year-Month'],
      dtype='object')

In [21]:
sales_perf_df = sales_perf_df.merge(Customers_df, on=['CustomerName', 'State', 'City'])
sales_perf_df = sales_perf_df.merge(Products_df, on=['Category', 'Sub-Category', 'Amount'])
sales_perf_df = sales_perf_df.merge(Payments_df, on=['Order ID', 'PaymentMode'])

In [22]:
sales_perf_df.columns

Index(['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
       'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City',
       'Year-Month', 'customer_Id', 'category_Id', 'payment_Id'],
      dtype='object')

In [24]:
Orders_df = sales_perf_df[['Order ID','customer_Id', 'category_Id', 'payment_Id' ,'Quantity', 'Profit', 'Order Date', 'Year-Month']].copy().drop_duplicates().reset_index(drop=True)
Orders_df.head()

,Order ID,customer_Id,category_Id,payment_Id,Quantity,Profit,Order Date,Year-Month
0,B-26776,1,1,1,5,1275,2023-06-27,2023-06-01
1,B-26776,2,1,1,5,1275,2024-12-27,2024-12-01
2,B-26776,3,1,1,5,1275,2021-07-25,2021-07-01
3,B-26776,1,2,1,14,1330,2023-06-27,2023-06-01
4,B-26776,2,2,1,14,1330,2024-12-27,2024-12-01

In [29]:
Customers_df.to_csv(r'C:\Users\USER\Desktop\Sale Performance\Sale-Performance\Dataset\cleanedadata\Customers.csv', index=False)
Products_df.to_csv(r'C:\Users\USER\Desktop\Sale Performance\Sale-Performance\Dataset\cleanedadata\Products.csv', index=False)
Payments_df.to_csv(r'C:\Users\USER\Desktop\Sale Performance\Sale-Performance\Dataset\cleanedadata\Payments.csv', index=False)
Orders_df.to_csv(r'C:\Users\USER\Desktop\Sale Performance\Sale-Performance\Dataset\cleanedadata\Orders.csv', index=False)

In [30]:
# Aggregated monthly profit

monthly_profit = Orders_df.groupby('Year-Month')['Profit'].sum().reset_index()
print("Monthly Profit Aggregate:")
print(monthly_profit)

Monthly Profit Aggregate:
   Year-Month  Profit
0  2020-03-01    6192
1  2020-04-01   36156
2  2020-05-01   24294
3  2020-06-01    9489
4  2020-07-01   12008
..        ...     ...
56 2024-11-01   15657
57 2024-12-01   20981
58 2025-01-01   38595
59 2025-02-01   28151
60 2025-03-01   13497

[61 rows x 2 columns]

In [33]:
# Top customers by order count
top_customers = Orders_df.groupby('customer_Id')['Order ID'].count().reset_index()
top_customers.columns = ['customer_Id', 'Order Count']
top_customers = top_customers.merge(Customers_df[['customer_Id', 'CustomerName']], on='customer_Id')
top_customers = top_customers.sort_values(by='Order Count', ascending=False).head(10)
print("Top Customers by Order Count:")
print(top_customers)

Top Customers by Order Count:
     customer_Id  Order Count      CustomerName
106          107            4     Eric Griffith
250          251            4      Jean Jackson
37            38            4  Kelsey Castaneda
38            39            4  Katherine Harris
107          108            4     Anna Ferguson
105          106            4       Scott Lewis
42            43            4      Andrew Allen
405          406            4       Kelly Smith
83            84            4     Claudia Curry
82            83            4   Christina Davis

In [34]:
# Quantity sold by category
# Assuming 'category_Id' is the category identifier in Orders_df
# and 'Category' is the category name in Products_df

quantity_by_category = Orders_df.groupby('category_Id')['Quantity'].sum().reset_index()
quantity_by_category = quantity_by_category.merge(Products_df[['category_Id', 'Category']], on='category_Id')
quantity_by_category = quantity_by_category.sort_values(by='Quantity', ascending=False)
print("Quantity Sold by Category:")
print(quantity_by_category)

Quantity Sold by Category:
     category_Id  Quantity         Category
505          506       102        Furniture
504          505        96        Furniture
348          349        80      Electronics
493          494        76        Furniture
687          688        64  Office Supplies
..           ...       ...              ...
675          676         1      Electronics
129          130         1      Electronics
577          578         1        Furniture
309          310         1  Office Supplies
48            49         1  Office Supplies

[800 rows x 3 columns]

In [ ]:
# Merge Customers_df with Orders_df to add the 'City' column
Orders_df = pd.merge(
    Orders_df, 
    Customers_df[['customer_Id', 'City']],  # Select only 'customer_Id' and 'City' from Customers_df
    on='customer_Id',  # Join on the foreign key
)

In [44]:
Orders_df.drop(columns=['City_x', 'City_y'], inplace=True)

In [45]:
Orders_df.head()

,Order ID,customer_Id,category_Id,payment_Id,Quantity,Profit,Order Date,Year-Month,City
0,B-26776,1,1,1,5,1275,2023-06-27,2023-06-01,Miami
1,B-26776,2,1,1,5,1275,2024-12-27,2024-12-01,Chicago
2,B-26776,3,1,1,5,1275,2021-07-25,2021-07-01,Buffalo
3,B-26776,1,2,1,14,1330,2023-06-27,2023-06-01,Miami
4,B-26776,2,2,1,14,1330,2024-12-27,2024-12-01,Chicago

In [ ]:
# Now proceed to calculate low-sales cities

low_sales_threshold = 100
low_sales_cities = Orders_df.groupby('City')['Order ID'].count().reset_index()
low_sales_cities.columns = ['City', 'Order Count']
low_sales_cities = low_sales_cities[low_sales_cities['Order Count'] < low_sales_threshold]

print("Cities with Low Sales Probability:")
print(low_sales_cities.sort_values('Order Count'))

Cities with Low Sales Probability:
             City  Order Count
5        Columbus           49
12         Peoria           50
7         Houston           52
17          Tampa           57
8     Los Angeles           61
3      Cincinnati           61
10  New York City           62
2         Chicago           63
0          Austin           65
9           Miami           66
16    Springfield           68
4       Cleveland           70
6          Dallas           72
14      San Diego           73
13      Rochester           74
11        Orlando           77
15  San Francisco           84
1         Buffalo           90

#### Data Loading into Postgres

In [55]:
import psycopg2

In [56]:
def get_db_connection():
    connection = psycopg2.connect(
        host="localhost",
        database="sales_project",
        user="postgres",
        password="Tanitoluwa1."
    )
    return connection

In [57]:
conn = get_db_connection()